blog/2013-09-08-linkfest.org
#+TITLE: Weekend Linkfest 8.9.2013
#+DATE: 2013-09-08
#+SETUPFILE: ~/Dropbox/octopress/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linkfest
#+JEKYLL_PUBLISHED: true

* Statistics and Machine Learning
- [[http://strata.oreilly.com/2013/09/data-analysis-just-one-component-of-the-data-science-workflow.html][Data Analysis: Just one component of the Data Science workflow - Strata]]
- [[http://abbottanalytics.blogspot.de/2013/09/on-data-mining-contests.html][Data Mining and Predictive Analytics: On Data Mining Contests]]
- [[https://vimeo.com/73895273][Personalizing spatial search by blending machine learning and spatial statistics on Vimeo]]
- [[http://geomblog.blogspot.de/2013/09/statistics-geometry-and-computer-science.html][Statistics, geometry and computer science]]
- [[http://mcburton.net/blog/joy-of-tm/][Topic Modeling for JDH]]
- [[http://normaldeviate.wordpress.com/2013/09/01/is-bayesian-inference-a-religion/][Is Bayesian Inference a Religion?]]
- [[http://vis.berkeley.edu/courses/cs294-10-fa13/wiki/index.php/Main_Page][CS 294-10 Visualization Fa1 2013]]
* R Package of the Week
- [[http://cran.r-project.org/web/packages/RVowpalWabbit/index.html][RVowpalWabbit]]
* Paper of the Week
- [[http://nlp.stanford.edu/sentiment/index.html][Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank]]
* Programming
- [[http://arxiv.org/abs/1308.4214][Pylearn2: a machine learning research library]]
- [[http://mloss.org/revision/view/1382/][mloss Project]]
- [[http://julien.danjou.info/books/the-hacker-guide-to-python][The Hacker Guide to Python | Julien Danjou]]
- [[http://www.r-bloggers.com/using-google-maps-api-and-r/][Using Google maps API and R]]
- [[https://vimeo.com/73628111][Dataflow Programming Using Generators and Coroutines on Vimeo]]
- [[http://julialang.org/blog/2013/09/fast-numeric/][Fast Numeric Computation in Julia]]
- [[http://williamjturkel.net/2013/09/03/working-with-structured-data-using-command-line-tools-in-linux/][Working with Structured Data Using Command Line Tools in Linux]]
- [[http://blinkdb.org/][BlinkDB: Queries with Bounded Errors and Bounded Response Times on Very Large Data]]
- [[http://www.milanor.net/blog/?p%3D853][An example of MapReduce with rmr2]]
- [[http://randyzwitch.com/python-pypy-julia-r-pqr-jit-just-in-time-compiler/][Fun With Just-In-Time Compiling: Julia, Python, R and pqR]]
- [[http://librestats.com/2012/08/14/some-quirks-of-the-r-language/][Some Quirks of the R Language]]
* Elsewhere
- [[http://www.nytimes.com/2013/09/06/us/nsa-foils-much-internet-encryption.html?pagewanted%3Dall&_r%3D1&][N.S.A. Able to Foil Basic Safeguards of Privacy on Web]]
- [[http://www.theguardian.com/world/2013/sep/05/nsa-how-to-remain-secure-surveillance][NSA surveillance: how to stay secure]]
