blog/2013-09-08-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 8.9.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning Data Analysis: Just one component of the Data Science workflow - Strata Data Mining and Predictive Analytics: On &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 8.9.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://strata.oreilly.com/2013/09/data-analysis-just-one-component-of-the-data-science-workflow.html">Data Analysis: Just one component of the Data Science workflow - Strata</a>
</li>
<li><a href="http://abbottanalytics.blogspot.de/2013/09/on-data-mining-contests.html">Data Mining and Predictive Analytics: On Data Mining Contests</a>
</li>
<li><a href="https://vimeo.com/73895273">Personalizing spatial search by blending machine learning and spatial statistics on Vimeo</a>
</li>
<li><a href="http://geomblog.blogspot.de/2013/09/statistics-geometry-and-computer-science.html">Statistics, geometry and computer science</a>
</li>
<li><a href="http://mcburton.net/blog/joy-of-tm/">Topic Modeling for JDH</a>
</li>
<li><a href="http://normaldeviate.wordpress.com/2013/09/01/is-bayesian-inference-a-religion/">Is Bayesian Inference a Religion?</a>
</li>
<li><a href="http://vis.berkeley.edu/courses/cs294-10-fa13/wiki/index.php/Main_Page">CS 294-10 Visualization Fa1 2013</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://cran.r-project.org/web/packages/RVowpalWabbit/index.html">RVowpalWabbit</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://nlp.stanford.edu/sentiment/index.html">Recursive Deep Models for Semantic Compositionality Over a Sentiment Treebank</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://arxiv.org/abs/1308.4214">Pylearn2: a machine learning research library</a>
</li>
<li><a href="http://mloss.org/revision/view/1382/">mloss Project</a>
</li>
<li><a href="http://julien.danjou.info/books/the-hacker-guide-to-python">The Hacker Guide to Python | Julien Danjou</a>
</li>
<li><a href="http://www.r-bloggers.com/using-google-maps-api-and-r/">Using Google maps API and R</a>
</li>
<li><a href="https://vimeo.com/73628111">Dataflow Programming Using Generators and Coroutines on Vimeo</a>
</li>
<li><a href="http://julialang.org/blog/2013/09/fast-numeric/">Fast Numeric Computation in Julia</a>
</li>
<li><a href="http://williamjturkel.net/2013/09/03/working-with-structured-data-using-command-line-tools-in-linux/">Working with Structured Data Using Command Line Tools in Linux</a>
</li>
<li><a href="http://blinkdb.org/">BlinkDB: Queries with Bounded Errors and Bounded Response Times on Very Large Data</a>
</li>
<li><a href="http://www.milanor.net/blog/?p%3D853">An example of MapReduce with rmr2</a>
</li>
<li><a href="http://randyzwitch.com/python-pypy-julia-r-pqr-jit-just-in-time-compiler/">Fun With Just-In-Time Compiling: Julia, Python, R and pqR</a>
</li>
<li><a href="http://librestats.com/2012/08/14/some-quirks-of-the-r-language/">Some Quirks of the R Language</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Elsewhere</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://www.nytimes.com/2013/09/06/us/nsa-foils-much-internet-encryption.html?pagewanted%3Dall&_r%3D1&">N.S.A. Able to Foil Basic Safeguards of Privacy on Web</a>
</li>
<li><a href="http://www.theguardian.com/world/2013/sep/05/nsa-how-to-remain-secure-surveillance">NSA surveillance: how to stay secure</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-09-08T00:00:00+02:00" pubdate data-updated="true">Sep 8<span>th</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>